const datas = [
    {
        text: "“มีเงินดีกว่าไม่มีเงิน” หรือ มีมากดีกว่ามีน้อย กล่าวแค่นี้คงไม่มีใครแย้งเป็นแน่ เพราะในคนที่พูดว่า เงินซื้อความสุขไม่ได้นั้น เขาก็ไม่ได้กำลังหมายความว่า “ไม่มีเงินแล้วจะสุขกว่า” เสียเมื่อไหร่ (ดังนั้นเขาไม่โอนให้เราหรอก 😛)",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ไม่ว่าเป้าหมายหรือความหวังนั้นจะเป็น คน สิ่งของ ความสำเร็จ หรือสิ่งที่มีผลต่อจิตใจเราในด้านใดด้านหนึ่ง เพราะมันจะทำให้เรารู้สึกสูญเสีย หรือสิ้นหวังได้นั่นเอง",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ลบอาจไม่ได้ช่วยให้ลืม เหมือนชื่อเพลง* เพราะบางคนที่พยายามลบทุกสิ่ง ทิ้งทุกอย่าง เปลี่ยนเส้นทางเพื่อเดินหน้า แต่ว่าก็ดันเหมือนคนที่เกิดมีความจำดีในเวลาที่ไม่ต้องการ ภาพเหล่านั้นยังคงกลับมาให้รู้สึกได้อยู่อีกเสมอ ๆ เสมือนว่าลบไม่ช่วยอะไร",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "สิ่งหนึ่งที่ต้องไม่ลืมในกีฬามีโค้ช มีผู้จัดการทีมคิดแทนหรือนำทางให้ แต่ชีวิตเราต้องมีสติตัดสินใจด้วยตัวเอง ถ้ากำลังอ่อนล้า คิดอะไรไม่ออก แสดงว่ากำลังจะแข่งไม่ไหว ถึงเวลาไปม้านั่งสำรอง การได้พักนั่งมองเกมคนอื่นก็ไม่ได้มีข้อเสียอะไร อาจได้ช่องทาง ไอเดียใหม่ ๆ ให้กับตัวเองได้อีกทาง",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "เพราะชีวิตไม่ว่าช่วงเวลาไหนเราก็คาดเดาอะไรไม่ได้อยู่แล้ว มันจึงต้องปรับตามสิ่งที่เป็นจริง วันนี้เดินช้า วันหน้าเดินเร็ว วันนี้ทุกข์ใจ ก็ต้องผ่านให้ได้ วันหน้าที่จะสุขใจก็ยังพร้อมรออยู่ มีง่าย มียาก สลับกันไป “เลิกเดา” แล้วปรับตัวตามเท่าที่เราทำได้ แล้วทำให้เต็มที่ ดีที่สุด…",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "การที่พยายามสำเร็จในเรื่องหนึ่งมาก ๆ แล้วคิดว่าเห็นไหม “ก็ยังมีข้อจำกัด” อยู่ดี มันอาจเป็นเรื่องที่ไม่ผิด แต่ควรต้องพิจารณาที่ความเหมาะสมด้วย คล้ายคำคมของผมที่เคยเขียนไว้ว่า “ต้นไม้งามไม่ได้มีเฉพาะสีเขียว ความสำเร็จของเรา ก็ใช่ว่าต้องเป็นสิ่งเดียวกับคนอื่น”",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ทำวันนี้ให้ดีที่สุด ที่จริงเป็นประโยคที่เป็นความจริง และมันดีมากสำหรับคนที่มีเป้าหมายชัดเจน แต่หลายคนมันเป็นเพียงการเลือกประโยคที่ “คิดว่า” ดีที่สุดในตัวของมัน ดูเป็นกลาง ไม่อิงอดีต อนาคต แต่บางทีก็ดูไม่มีเป้าหมาย รวมถึงผู้ที่ยึดถือและเชื่อนั้น อาจไม่เคยพบ หรือรู้แท้จริงเลยว่า “ดีที่สุดนั้นมันอยู่ตรงไหน?..”",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ด้วยความที่ คุณเสือ หรือผมควรเรียกว่า พี่เสือ เป็นหนึ่งในศิลปินที่ผมชื่นชอบ จึงติดตามดูสัมภาษณ์ทั้ง 2 ตอน(จบ) ได้รู้เรื่องราวประวัติการทำงาน รูปแบบการทำงานค่ายเพลง ที่ในฐานะคนนอกวงการไม่เคยรู้มาก่อน จนในช่วงหนึ่งท้าย ๆ รายการผู้ดำเนินรายการ หรือ ป๋าเต็ดได้ถามถึงการที่เพลงมีลิขสิทธิ์ข้ามค่าย ไม่สามารถจะนำมาแสดงได้อย่างอิสระ ว่ารู้สึกอย่างไร พี่เสือ ได้ก็ตอบคำถามได้ดีอย่างชัดเจน และป๋าเต็ดก็กำลังสรุปในทำนองชื่นชมว่า พี่เสือเป็นผู้มองโลกบนความเป็นจริง ขณะนั้นเองจึงมีประโยคจาก พี่เสือ ธนพล ว่า “เราเป็นใคร เราจะผิดหวังไม่ได้? เราเป็นใครเราถึงจะล้มเหลวไม่ได้… ได้สิ เราก็มนุษย์คนหนึ่ง” ผมก็พยักหน้าตามป๋าเต็ด.. อืม.. ใช่ ๆ เหมือนในรายการทันที",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "น่าเสียดายนะครับถ้าเกิดกับคนที่มีศักยภาพ หากมัวแต่คอยไปนั่งมองคนอื่น “พยายาม” ในหลายครั้งผมเสียดายมากจริงๆ เวลาเห็นคนที่เป็นแบบนี้ อิจฉาด้วยซ้ำไป อยากได้ศักยภาพของเขา ในขณะที่เราต้อง พยายามเอาเองมากมายกว่าจะได้ หรือไม่มีเท่าเขาตรงนั้นด้วยซ้ำไป",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ถ้าทบทวนตัวเองอย่างดีแล้ว การที่เรารู้ว่าอะไรดีกว่า แต่ว่าไม่ทำนั้น อาจเพราะเรามีเป้าหมายอื่นที่แตกต่าง อาจเป็นเป้าหมายส่วนตัว เป้าหมายที่คนส่วนใหญ่ไม่ได้คิดเหมือนเรา ก็ไม่ผิดอะไร แต่ย้ำว่า “ทบทวนดีแล้ว” เช่นนี้ ก็ไม่จำเป็นต้องไม่มีใครเข้าใจอะไรไปกับเราว่า ดีกว่าทำไมไม่ทำ…",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "คนอยากได้ความรู้โลกเราจะเป็นอย่างไร เขาก็คงขวนขวายหาใส่ตัวอยู่ดีแม้ไม่ได้มีโลกออนไลน์ ส่วนคนไม่ได้ “มีใจ” จะมีหรือไม่มีโลกออนไลน์เขาก็ไปสนใจอะไรที่ไม่ใช่ความรู้อยู่ดี..",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "นี่คืออีกด้านของ Know Who การรู้จักใครมันก็เป็นสิ่งสำคัญเหมือนกัน ใช่เพียงแง่ความเหลื่อมล้ำ หากไม่มองแค่แง่ อคติ ความไม่ยุติธรรม มันก็ไม่ใช่สิ่งที่กำหนดทุกอย่าง เพราะที่สุดแล้ว “เราเลือกได้” ว่าจะเรียนรู้ หรืออยู่อย่างไร…",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "คนเราไม่จำเป็นต้องรู้ไปทุกอย่าง การยอมรับตัวเองว่าไม่รู้เสียบ้างไม่ใช่เรื่องเสียหายอะไร และ “พลังเงียบ” ในกรณีเช่นนี้ มันจะช่วยให้เรา “ฟัง” เพื่อจะได้รู้ในเรื่องนั้น ๆ หากเราคิดแต่จะ “พูดด้วย” เราก็คงจดจ่อในความคิดว่า พูดอะไรดีนะ จนไม่ได้ตั้งใจฟังเรื่องดังกล่าว หรือฟังเพื่อหาช่อง (พูด) เสริม แทรกต่อ มิใช่ฟังเพื่อรู้ ส่วนใหญ่การโง่เรื่องไหน มันก็แค่ไม่รู้เรื่องนั้นมาก่อนเท่านั้นเอง..",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ส่งท้ายกับปัจจุบันนี้ ความไม่ประมาท ชีวิตจะมีสุขกว่าคิดมาก (ประสาท) หากเรื่องใด คิดแล้วดีต่อชีวิต เป็นไปในทางที่ชีวิตมีความสุขมันไม่เกี่ยวว่าเราคิดมาก คิดน้อย กับเรื่องนั้นแค่ไหน เราอาจต้องมีเครียด มีทุกข์ใจในความคิดบ้าง เช่น โควิดระบาดรอบสองมาทำอย่างไร แต่ที่สุด คิดให้หาทางออก คิดให้ใจเป็นสุข หรือคิดไว้ล่วงหน้า ที่ไม่ได้บอกว่าจะรับมือได้ แต่เข้าใจมันให้ได้และปรับตัวหาหนทางที่ดีที่สุดต่อไป อย่าปล่อยให้ใจหมองเศร้า และเราเป็นประสาท นั่นจะยิ่งทำให้เราไม่มีใจคิดถึงวันพรุ่งนี้ ที่พอไม่คิดไปข้างหน้าเมื่อใด เราก็ประมาทต่อไปอยู่ดี…",
        author: "Facebook Sirichaiwatt"
    },
    {
        text: "ที่สำคัญเราต้องระวัง “ความเชื่อ” ที่อาจหลงไปในอัตตาตัวตน และอคติโดยไม่เจตนา หรือ bias (ไบแอส-อคติ) หลาย ๆ ประการ ผมชอบพูดว่าความเชื่อมันน่ากลัว บางคนก็บอกว่าไม่จริงหรอก ความยึดมั่นถือมั่นต่างหาก ก็เห็นด้วย มีความเชื่อไว้บ้างก็ดี แต่ต้องไม่ยึดมั่นถือมั่นให้มันเกินพอดี ต้องพร้อมและกล้าที่จะเปลี่ยนแปลง",
        author: "Facebook Sirichaiwatt"
    },

]

window.addEventListener('DOMContentLoaded', randomQuote);

const generateBtn = document.getElementById('generate');
const quoteBox = document.querySelector('.quote-box');

generateBtn.addEventListener('click', randomQuote);

function randomQuote() {
    const index = Math.floor(Math.random() * datas.length);
    const data = datas[index];
    const quote = `<p class="text">${data.text}</p>
                    <p class="author">${data.author}</p>`;
    quoteBox.innerHTML = quote;
}